Revit 2027 API
DWFImportOptions(DWFImportOptions) Constructor
 Constructs a new instance of DWFImportOptions as a copy of the import options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DWFImportOptions(
	DWFImportOptions option
)
Public Sub New (
	option As DWFImportOptions
)
public:
DWFImportOptions(
	DWFImportOptions^ option
)
new :
        option : DWFImportOptions -> DWFImportOptions
Parameters
option DWFImportOptions
 The options to be copied.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DWFImportOptions Class
DWFImportOptions Overload
Autodesk.Revit.DB Namespace